import {useState} from "react";
import {OtherService} from "@store/store.ts";
import {UserLogin} from "@page/public/LoginPage.tsx";

export interface UserRegister extends UserLogin{
    address: string
    name: string
    surname: string
}


export const RegisterPage = () => {
    const [user, setUser] = useState<UserRegister>({
        email: "",
        password: "",
        address: "",
        name: "",
        surname: "",
    })

    // TODO make real login
    function register() {

    }

    // TODO make real login by oauth
    function loginOtherService(nameService: OtherService) {
        console.log(nameService)
    }

    return (
        <div className="modal-dialog mb-4" role="document" style={{maxWidth: "450px"}}>
            <div className="modal-content rounded-4 shadow">
                <div className="modal-header p-5 pb-4 border-bottom-0">
                    <h1 className="fw-bold mb-0 fs-2">Регистрация для пользователей</h1>
                </div>

                <div className="modal-body p-5 pt-0">
                    <div className="form-floating mb-3">
                        <input type="email"
                               className="form-control rounded-3"
                               id="floatingName"
                               placeholder="Василий"
                               value={user.name}
                               onChange={event => setUser({...user, name: event.target.value})}
                        />
                        <label htmlFor="floatingName">Имя</label>
                    </div>
                    <div className="form-floating mb-3">
                        <input type="email"
                               className="form-control rounded-3"
                               id="floatingSurName"
                               placeholder="Давыдов"
                               value={user.surname}
                               onChange={event => setUser({...user, surname: event.target.value})}
                        />
                        <label htmlFor="floatingSurName">Фамилия</label>
                    </div>
                    <div className="form-floating mb-3">
                        <input type="email"
                               className="form-control rounded-3"
                               id="floatingAddress"
                               placeholder="г. Москва ул. Проспект-Вернадского дом 12"
                               value={user.address}
                               onChange={event => setUser({...user, address: event.target.value})}
                        />
                        <label htmlFor="floatingAddress">Адрес</label>
                    </div>
                    <div className="form-floating mb-3">
                        <input type="email"
                               className="form-control rounded-3"
                               id="floatingInput"
                               placeholder="name@example.com"
                               value={user.email}
                               onChange={event => setUser({...user, email: event.target.value})}
                        />
                        <label htmlFor="floatingInput">Электронная почта</label>
                    </div>
                    <div className="form-floating mb-3">
                        <input type="password"
                               className="form-control rounded-3"
                               id="floatingPassword"
                               placeholder="Password"
                               value={user.password}
                               onChange={event => setUser({...user, password: event.target.value})}
                        />
                        <label htmlFor="floatingPassword">Пароль</label>
                    </div>
                    <button className="w-100 mb-2 btn btn-lg rounded-3 btn-primary" type="submit"
                            onClick={register}>Зарегестироваться
                    </button>
                    <small className="text-body-secondary">Нажав кнопку регистрации, вы соглашаетесь с условиями
                        использования.</small>
                    <hr className="my-4"/>
                    <h2 className="fs-5 fw-bold mb-3">Войти через</h2>
                    <button
                        onClick={() => loginOtherService(OtherService.VK)}
                        className="w-100 py-2 mb-2 btn btn-outline-primary rounded-3"
                        type="submit">
                        <svg xmlns="http://www.w3.org/2000/svg" className="bi me-2" width="20" height="20"
                             viewBox="-3.6 -6 31.2 36">
                            <rect width="80%" height="70%" fill="white" rx="5" ry="5"/>
                            <path fill-rule="evenodd" fill="#4872a3"
                                  d="M15.68 0C22.4 0 24 1.6 24 8.32v7.36C24 22.4 22.4 24 15.68 24H8.32C1.6 24 0 22.4 0 15.68V8.32C0 1.6 1.6 0 8.32 0zM6.5 7.5H4.75c-.5 0-.6.24-.6.49 0 .47.59 2.77 2.76 5.81a6.85 6.85 0 005.34 3.2c1.11 0 1.25-.25 1.25-.68v-1.57c0-.5.11-.6.46-.6.35 0 .7.13 1.74 1.13 1.19 1.19 1.38 1.72 2.05 1.72h1.75c.5 0 .75-.25.61-.74a7.43 7.43 0 00-1.48-2.05c-.41-.49-1-1-1.21-1.26-.21-.26-.18-.49 0-.78a21.83 21.83 0 002.36-4c.11-.37 0-.64-.53-.64H17.5a.77.77 0 00-.76.49 14.67 14.67 0 01-2.15 3.58c-.41.41-.6.54-.82.54-.22 0-.27-.13-.27-.5v-3.5c0-.44-.13-.64-.5-.64h-2.75a.43.43 0 00-.45.4c0 .42.64.52.7 1.71v2.57c0 .57-.1.67-.32.67-.6 0-2-2.18-2.9-4.67C7.12 7.7 7 7.5 6.5 7.5z"/>
                        </svg
                        >
                        Войти через Вконтакте
                    </button>
                    <button
                        onClick={() => loginOtherService(OtherService.YANDEX)}
                        className="w-100 py-2 mb-2 btn btn-outline-warning rounded-3"
                        type="submit">
                        <svg xmlns="http://www.w3.org/2000/svg" className="bi me-2" width="20" height="20"
                             fill="none" viewBox="0 0 26 26">
                            <path fill="#fc3f1d"
                                  d="M13 26c7.18 0 13-5.82 13-13S20.18 0 13 0 0 5.82 0 13s5.82 13 13 13z"></path>
                            <path fill="#fff"
                                  d="M17.15 20.28h-2.58V7.518h-1.149c-2.101 0-3.206 1.062-3.206 2.633 0 1.787.769 2.61 2.34 3.672l1.3.867-3.738 5.59H7.334l3.358-4.99c-1.932-1.374-3.011-2.728-3.011-4.987 0-2.85 1.971-4.778 5.73-4.778h3.738l.001 14.755z"></path>
                        </svg>
                        Войти через Яндекс
                    </button
                    >
                    <button
                        onClick={() => loginOtherService(OtherService.GOSUSLUGI)}
                        className="w-100 py-2 mb-2 btn btn-outline-primary rounded-3"
                        type="submit">
                        <svg viewBox="0 0 90 90" className="bi me-2" width="20" height="20"
                             xmlns="http://www.w3.org/2000/svg">
                            <rect width="100%" height="100%" fill="white" rx="15" ry="15"/>
                            <defs>
                                <linearGradient x1="50.006%" y1="-.009%" x2="50.006%" y2="100.17%" id="a">
                                    <stop stopColor="#1466AC" offset="40%"/>
                                    <stop stopColor="#EF4058" offset="66%"/>
                                </linearGradient>
                            </defs>
                            <g fill="none" fillRule="evenodd">
                                <path
                                    d="M72.872 45.829h-2.72a.183.183 0 0 0-.17.17v8.63c-.594.17-1.19.255-1.869.255-1.785 0-2.21-.552-2.21-2.933v-5.952a.183.183 0 0 0-.17-.17h-2.718a.183.183 0 0 0-.17.17v6.25c0 3.91 1.317 5.399 4.673 5.399 1.912 0 4.079-.51 5.354-.978.042-.043.084-.085.084-.128V46c.085-.085 0-.17-.084-.17Zm-57.613.043h-2.762c-.085 0-.127.042-.127.127-.425 1.7-1.317 4.591-2.507 7.61l-2.761-7.652c-.043-.043-.085-.085-.128-.085H4.17c-.043 0-.085.042-.128.085-.042.042-.042.085 0 .127l4.164 11.394a36.97 36.97 0 0 1-1.19 2.295c-.297.51-.552 1.02-.807 1.573-.042.043-.042.085 0 .128.043.042.085.085.128.085h3.016c.043 0 .128-.043.128-.085a55.123 55.123 0 0 0 1.742-3.741c1.784-4.167 3.186-8.078 4.249-11.649 0-.042 0-.085-.043-.127-.085-.085-.127-.085-.17-.085Zm9.9 8.757a.091.091 0 0 0-.085-.085h-.128c-.68.255-1.912.425-2.762.425-1.911 0-2.804-.51-2.804-3.4 0-2.339.298-3.402 2.804-3.402.723 0 1.36.085 2.21.34.085 0 .127 0 .17-.085l1.104-2.21v-.128a.091.091 0 0 0-.085-.085 12.812 12.812 0 0 0-3.611-.553c-3.951 0-5.736 1.871-5.736 6.08 0 4.251 1.785 6.164 5.736 6.164.977 0 2.974-.212 3.909-.595.085-.043.127-.128.085-.213l-.807-2.253Zm25.874-8.757h-2.761c-.085 0-.128.042-.128.127-.425 1.743-1.317 4.591-2.507 7.61l-2.761-7.652c-.043-.043-.085-.085-.128-.085h-2.804c-.042 0-.085.042-.127.085-.043.042-.043.085 0 .127l4.163 11.394a36.97 36.97 0 0 1-1.19 2.295c-.297.51-.552 1.02-.807 1.573-.042.043-.042.085 0 .128.043.042.085.085.128.085h3.016c.043 0 .128-.043.128-.085a55.123 55.123 0 0 0 1.742-3.741c1.742-4.167 3.186-8.078 4.249-11.649 0-.042 0-.085-.043-.127-.085-.085-.127-.085-.17-.085Zm10.197-.043H53.2a.183.183 0 0 0-.17.17V57.18c0 .085.085.17.17.17h2.72c.084 0 .17-.085.17-.17v-8.673h4.205c.043 0 .128-.042.128-.085.34-.765.637-1.573.977-2.38v-.128c-.085-.042-.127-.085-.17-.085Z"
                                    fill="#EF3E58" fillRule="nonzero"/>
                                <path
                                    d="M18.488 28.654c-3.909 0-5.438 1.7-5.438 5.994 0 4.379 1.53 6.08 5.438 6.08 3.951 0 5.48-1.701 5.48-6.08 0-4.294-1.529-5.994-5.48-5.994Zm0 9.608c-1.784 0-2.337-.468-2.337-3.529 0-3.23.595-3.528 2.337-3.528 1.785 0 2.38.297 2.38 3.528 0 3.019-.553 3.529-2.38 3.529Zm16.358-.468a.091.091 0 0 0-.085-.085h-.128c-.68.255-1.912.425-2.761.425-1.912 0-2.805-.51-2.805-3.4 0-2.34.255-3.402 2.805-3.402.722 0 1.36.085 2.209.34.085 0 .127 0 .17-.085l1.104-2.21v-.128a.091.091 0 0 0-.085-.085 12.812 12.812 0 0 0-3.61-.553c-3.952 0-5.737 1.87-5.737 6.08 0 4.25 1.785 6.164 5.736 6.164.977 0 2.974-.213 3.909-.595.085-.043.127-.128.085-.213l-.807-2.253Zm-30.676-8.8a.183.183 0 0 0-.17.17v11.18c0 .086.085.17.17.17h2.72c.084 0 .17-.084.17-.17v-8.672h4.205c.043 0 .128-.042.128-.085.34-.765.637-1.573.977-2.38v-.128c-.043-.043-.085-.085-.128-.085H4.17Z"
                                    fill="#0F67B1" fillRule="nonzero"/>
                                <path
                                    d="M81.575 56.16v-.17c0-.085 0-.213.043-.298.127-1.573.212-3.486.297-5.697v-.17L82 45.064c0-1.658-.042-3.274-.085-4.762v-.17l-.297-5.696c0-.086 0-.213-.043-.298v-.17c0-.17-.042-.298-.042-.468v-.17c-.128-1.658-.213-2.678-.255-2.763 0-.17-.043-.34-.043-.468v-.127a6.023 6.023 0 0 0-.17-.85c0-.043 0-.086-.042-.128-.722-3.444-2.634-7.227-5.014-10.076-.934-1.105-1.912-2.083-2.931-2.848a135.271 135.271 0 0 0-11.94-7.865c-6.245-3.699-11.853-6.25-12.575-6.59-.043 0-.043-.042-.043-.042C46.863.85 44.866.34 42.7.128c-.425-.043-.85-.085-1.275-.085-.383 0-.765-.043-1.147-.043h-.595c-2.932.043-5.608.595-7.733 1.573-.34.128-5.99 2.72-12.406 6.462l-.255.127A154.73 154.73 0 0 0 7.35 16.07c-1.614 1.19-3.059 2.72-4.376 4.676-.297.468-.297 1.573.977 1.573h3.272c1.402 0 1.742-.85 3.314-1.998 1.742-1.275 5.183-3.826 11.471-7.567 4.546-2.678 8.795-4.762 10.834-5.74.043 0 .085-.042.128-.042 0 0 .042 0 .042-.042 0 0 .043 0 .043-.043.042 0 .085-.042.085-.042.042 0 .085-.043.127-.043.51-.255.85-.383.85-.383 1.445-.637 3.484-1.062 5.65-1.105h.85c.638 0 1.275.043 1.87.128 1.317.17 2.507.425 3.484.85.085.042.212.085.297.127a143.63 143.63 0 0 1 12.152 6.377 137.128 137.128 0 0 1 11.471 7.568c.807.595 1.615 1.445 2.38 2.38 1.911 2.466 3.483 5.825 3.738 8.418 0 .043.128 1.063.255 2.806 0 .127 0 .212.043.34v.255c0 .17.042.298.042.468v.17c0 .085 0 .212.043.297 0 .213.042.425.042.638 0 .128 0 .255.043.383v.085c0 .17 0 .297.042.467v.34c.287 5.07.287 10.15 0 15.22v.34c0 .17 0 .298-.042.468v.085c0 .127 0 .255-.043.382 0 .213-.042.426-.042.638 0 .128 0 .213-.043.298v.17c0 .17-.042.297-.042.467v.256c0 .127 0 .255-.043.34-.127 1.743-.255 2.805-.255 2.805-.255 2.594-1.827 5.952-3.739 8.418-.764.978-1.572 1.786-2.379 2.38-.042 0-1.147.851-2.974 2.126a136.965 136.965 0 0 1-20.479 11.734l-.17.085c-.085.043-.212.085-.297.128-.977.382-2.167.68-3.484.85-.595.085-1.232.127-1.87.127h-.85c-2.166-.042-4.205-.425-5.65-1.105 0 0-.297-.127-.85-.383-.042-.042-.127-.042-.17-.085-.042-.042-.085-.042-.127-.085-.043 0-.043-.042-.085-.042-.043 0-.085-.043-.127-.043-.043-.042-.085-.042-.17-.085h-.043a138.21 138.21 0 0 1-10.58-5.611c-6.33-3.699-9.729-6.292-11.47-7.568-1.573-1.148-1.913-1.998-3.315-1.998H3.951c-1.274 0-1.274 1.106-.977 1.53C4.291 71.21 5.736 72.74 7.35 73.93c.213.17 5.396 3.996 11.94 7.865.339.213.679.425 1.061.595 6.076 3.486 11.302 5.867 11.6 6.037 2.081.935 4.8 1.488 7.69 1.573h.594c.383 0 .765 0 1.147-.043.425 0 .85-.042 1.275-.085 2.167-.212 4.206-.722 5.82-1.445 0 0 .043 0 .043-.042.722-.34 6.33-2.934 12.576-6.59a156.319 156.319 0 0 0 8.795-5.612l3.144-2.253c1.02-.765 1.997-1.743 2.932-2.848 2.38-2.849 4.291-6.632 5.013-10.076 0-.042 0-.085.043-.127.042-.298.127-.596.17-.85V59.9c.042-.17.042-.34.042-.468 0-.085.128-1.105.255-2.763v-.17c.085-.043.085-.213.085-.34"
                                    fill="url(#a)" transform="translate(4)"/>
                                <path
                                    d="M37.65 45.829h-8.328c-.085 0-.127.043-.17.128-.212 3.783-.934 7.822-1.954 11.138 0 .042 0 .085.042.127.043.043.085.043.128.043h2.847c.084 0 .127-.043.127-.085.807-2.55 1.445-5.867 1.7-8.673h2.719v8.63c0 .085.085.17.17.17h2.719c.085 0 .17-.085.17-.17v-11.18c0-.043-.085-.128-.17-.128Z"
                                    fill="#EF3E58" fillRule="nonzero"/>
                            </g>
                        </svg>
                        Войти через Госуслуги
                    </button
                    >
                </div>
            </div>
        </div>
    );
}